{
  "mechanical": {
    "time_periods": [
      2,
      2,
      2,
      2,
      2,
      3,
      3,
      7,
      7,
      10,
      10
    ],
    "stop_loss_rules": [
      "LARGE PROFITS ON SMALL RISKS You can make large profits on small risks provided you use a STOP LOSS order, and apply all the rules and wait for a definite indication of a change in trend up or down before you make a trade.",
      "HOW TO PROTECT PROFITS After you have accumulated profits it is just as important to protect them with STOP-LOSS orders as it is to protect your original capital because once you have made profits it is your capital and STOP LOSS orders must be used to protect it.",
      "If you place a STOP LOSS order this will put you out of the market automatically.",
      "They must follow the market trend as is indicated by fixed rules and protect their capital and profits by the use of STOP LOSS orders.",
      "Always, of course, protect with STOP LOSS orders.",
      "STOP LOSS ORDERS.",
      "Your capital and your profits must be protected at all times with STOP LOSS orders which must be placed when you make the trade and not later.",
      "When May Rye advances to this point you would watch for resistance and sell short with a STOP LOSS order at 161½.",
      "When you start trading be sure that you know all of the rules and that you follow them, and be sure that you place a STOP LOSS ORDER.",
      "WHERE TO PLACE STOP LOSS ORDERS: You must place STOP LOSS orders below the lows of swings and not just below the lows on the daily chart.",
      "STOP LOSS orders placed below closing prices on the daily or weekly chart are much safer and less likely to be caught because you are moving your STOPS according to the trend.",
      "The swings or reversals in a market are the prices to place STOP LOSS orders one way or the other.",
      "It is of great importance to know where to place a STOP LOSS order properly.",
      "Grains selling below $1 a bushel, a STOP LOSS order is as a rule safe and caught less of the time when you place it 1¢ below the bottom and especially 1¢ under closing prices, or 1¢ above closing prices.",
      "Then calculate just what your risk will be before you make the trade and after you make it, place the STOP LOSS order for your protection in case you are wrong.",
      "This is proof beyond any doubt that prices are never too high to buy if you follow the rules and protect with STOP LOSS orders.",
      "We have bought on definite rules and placed the STOP LOSS orders based on definite rules and sold out at an extreme high level on a definite rule because the option was nearing the end or reaching the 1st of May when we do not trade in an option.",
      "If you will only learn the rules and when the market runs into these extreme levels, not try to guess where the highs are going to be but simply follow the trend and follow up with STOP LOSS orders and buy regardless of price when new highs are made, you cannot fail to make enormous amounts of money.",
      "Again I repeat, you must always use a STOP LOSS order and must always continue to study and learn more and more about the records and you will make a success with Corn as well as anything else.",
      "If you do this and study and place STOP LOSS orders for protection, and trade only definite indications, you can make substantial profits trading in Rye Futures.",
      "Soy Beans is really the “millionaire money maker” but remember that if you buck the trend on Soy Beans, it can break a millionaire; therefore, use STOP LOSS orders every time you make a trade and LIMIT YOUR RISK and do not OVERTRADE and you can make enormous profits trading in Soy Beans.",
      "Your stop loss orders should be 1 to 2¢ per bushel under a daily bottom or under the Trend Line bottom, according to the rules.",
      "GrM-3 If an option is declining and only rallies one day, making a higher bottom but not making a higher top, then breaks to new lows, I do not consider it important or advisable to move the Trend Line up; neither would I move the stop loss order down above this \"within day\" top unless it was after a prolonged decline in a fast-moving market.",
      "HOW TO USE STOP LOSS ORDERS With this Method you must always use a stop loss order 1, 2, or 3¢ below the bottom or above the tops made by the Trend Indicator.",
      "When the market is moving slowly, you can use 1¢ stop loss orders with greater success and larger profits, but when an option fluctuates rapidly the move will often go 1½¢ over a top or under a bottom and not go 2¢, therefore a 2¢ stop loss order will not be caught as often.",
      "A stop loss order 3¢ under a Trend Line Bottom or over a Trend Line top will be caught less frequently than a 1 or 2¢ stop loss orders.",
      "However, as a general rule, I only advocate using 3¢ stop loss orders in very active markets.",
      "When Wheat is selling at very high prices, then you have to put your stop loss orders further away, but in most cases I never advise using a stop loss order more than 3¢ per bushel away.",
      "However, after Wheat has had a big advance or a big decline and you have big profits, then you can either follow up with stop loss orders 1¢ under each day’s bottom or above the top, or 3¢ per bushel below or above each day’s bottom or top, or follow down with a stop loss order 5¢ above [below?] the low level of each day or 5¢ per bushel under [above?] the top of each day until your stop is caught.",
      "Never risk 5¢ per bushel on any one trade to start with, only when you have big profits can you afford to have your stop loss order 5¢ per bushel away.",
      "1/2-POINT MOVES AND STOPS After Wheat has made a series of bottoms or tops around the same level and becomes very active, then it is just as well to move your stop loss order up 1/2¢ under the series of bottoms or place your stop 1/2¢ above the series of tops.",
      "–––––––––––––––– TRADING INSTRUCTIONS BUYING AND SELLING POINTS Rule 1 –TRADING ON TREND LINE INDICATIONS ONLY The simplest and easiest rule to use is to buy 10,000 bushels, 5,000 bushels, or any other unit that you start trading in, and place a stop loss order 1¢ under the last Trend Line bottom; then follow up with a stop loss order 1¢ under the last Trend Line bottom and never use any other indication to sell out until the Trend Line breaks 1¢ under the previous Trend Line bottom, where your stop is caught.",
      "Rule 2 –BUYING AT DOUBLE OR TRIPLE BOTTOMS Buy against double or triple bottoms and protect with stop loss order 1, 2, or 3¢ away according to the price and activity.",
      "GrM-5 The safest buying point is when an option makes a triple bottom near the same level, protected with a stop loss order not more than 1¢ under the lowest level of the triple bottom.",
      "The safest selling point is when an option makes a triple top near the same level, protected with a stop loss order not more than 1¢ above the highest level of the triple top.",
      "Rule 7 –7 TO 10-DAY RULE FOR AN ACTIVE, FAST-MOVING MARKET When an option of grain is very active, declining fast and making lower tops and lower bottoms each day, after is has declined 7 days or more, you should make your stop loss order 1¢ above each day’s top, and when your stops are caught, reverse position and buy, placing stop loss order 1¢ under the previous day’s bottom.",
      "Then reverse and go short, placing a stop loss order 1¢ above the previous day’s top.",
      "Then, when you get into this run, buy every 5¢ up, protecting with a stop loss order 1¢ under each day’s bottom or 1¢ under the last Trend Line bottom.",
      "By following up with a stop loss order 1¢ under the Trend Line bottom, you not get out until the main trend has changed.",
      "Rule 12 –FAST MARKET AND WIDE FLUCTUATIONS In fast-moving markets, like 1915 to 1917, and 1929, 1933, 1945 and 1946, when you pyramid and have very large profits, you should follow down with a stop loss order about 7 to 10¢ away from the market.",
      "Then, after a severe decline reduce stop loss orders, placing them about 3 to 5¢ above the low level, because when a market is moving as fast as this, you should not wait for the Trend Indicator to show a change in trend by crossing a Trend Line top or even a previous day’s top before changing position; also apply the rules for determining bottom by Signal Day and Opening and Closing Prices.",
      "To change the trend on the Trend Indicator, an option must advance 1 or more cents above the last top on the Trend Indicator, according to the activity and price of the option, whether you are using 1, 2, or 3¢ stop loss orders above the previous top.",
      "When there is a move of this kind, you should sell out and go short without waiting, placing a stop loss order on the shorts 1¢ above the final day’s high.",
      "Don’t forget to always use stop loss orders.",
      "In other words, if the 3-day Chart shows down trend, it is always better to sell short on rallies using the minor trend chart for placing stop loss orders.",
      "By carefully watching these Resistance levels in connection with your Trend Indicators, you can make a greater success and trade with closer stop loss orders.",
      "When an option advances or declines to this halfway point, you should sell or buy with a stop loss order 1, 2, or 3¢ according to whether the option is selling at very high or very low levels.",
      "If it is advancing very fast or declining very fast on large volume, do not consider that it is going to stop around these Resistance Levels unless it stops or holds one or two days around these levels; then sell or buy, protected with stop loss orders.",
      "The SPACE MOVEMENT would make this a selling level with a stop loss order 3 cents away.",
      "Stop loss order would be 262½.",
      "You can buy or sell against these resistance levels and place a stop loss order.",
      "2 New High and Low the Same Day –– Within Day HOW TO USE STOP LOSS ORDERS ––SPACE CHARTS –– HOURLY CHARTS..............................",
      "If an option is declining and only rallies one day, making a higher bottom but not making a higher top, then breaks to new lows, I do not consider it important or advisable to move the Trend Line up; neither would I move the stop loss order down above this \"within day\" top unless it was after a prolonged decline in a fast-moving market.",
      "In other words, if the 3-day Chart shows downtrend, it is always better to sell short on rallies, using the minor trend chart for placing stop loss orders.",
      "By carefully watching these Resistance Levels in connection with your Trend Indicators, you can make a greater success and trade with closer stop loss orders.",
      "If it is advancing very fast or declining very fast on large volume, do not consider that it is going to stop around these Resistance Levels unless it stops or holds one or two days around these levels; then sell or buy with stop loss orders.",
      "FIVE RULES RULE 1 – TRADING ON TREND LINE INDICATIONS ONLY You will make the most money by following Trend Line indications and by buying and selling on Trend Line indications and placing stop loss orders below Trend Line bottoms or above Trend Line tops and not taking profits until your stops are caught or the Trend Line reverses.",
      "RULES FOR EGGS RULE 1 - BUYING AT DOUBLE OR TRIPLE BOTTOMS Buy against double or triple bottoms and protect with stop loss order 10, 20, or 30 points away according to the price and activity.",
      "RULE 3 - 7 TO 10 DAY RULE FOR AN ACTIVE, FAST-MOVING MARKET When an option of eggs is very active, declining fast and making lower tops and lower bottoms each day, after it has declined 7 days or more, you should make your stop loss orders 10 points above each day's top, and when your stops are caught, reverse position and buy, placing stop loss order 10 points under the previous day's bottom.",
      "RULE 3 –STOP LOSS ORDERS Markets do make false moves at times and change trend suddenly."
    ]
  },
  "geometry": {
    "angles": [
      0,
      1,
      2,
      4,
      5,
      6,
      8,
      9,
      15,
      16,
      18,
      30,
      45,
      76,
      90,
      120,
      135,
      150,
      159,
      180,
      225,
      240,
      270,
      315,
      360
    ],
    "support_resistance_concepts": []
  },
  "time": {
    "cycles": [
      "15 days",
      "8 months",
      "10 days",
      "3 days",
      "3 weeks",
      "10 weeks",
      "2 days",
      "49 days",
      "7 weeks",
      "4 months",
      "4 days",
      "3 months",
      "90 days",
      "7 days",
      "45 days",
      "120 days",
      "3 day",
      "1 day",
      "4 weeks",
      "13 weeks",
      "91 days",
      "138 days",
      "26 weeks",
      "182 days",
      "227 days",
      "39 weeks",
      "273 days",
      "318 days",
      "52 weeks",
      "1 year",
      "10 day",
      "30 days",
      "60 days",
      "17 weeks",
      "35 weeks",
      "156 weeks",
      "3 years",
      "104 weeks",
      "2 years",
      "65 weeks",
      "36 weeks",
      "81 weeks",
      "91 weeks",
      "4 years",
      "63 weeks",
      "71 weeks",
      "8 years",
      "117 weeks",
      "88 weeks",
      "90 weeks",
      "90 months",
      "30 weeks",
      "8 days",
      "8 weeks",
      "120 weeks",
      "120 months",
      "28 days",
      "28 weeks",
      "28 months",
      "20 days",
      "20 weeks",
      "20 months",
      "20 years",
      "25 days",
      "25 weeks",
      "25 months",
      "67 months",
      "67 weeks",
      "50 days",
      "50 weeks",
      "50 months",
      "84 months",
      "7 years",
      "75 days",
      "75 weeks",
      "75 months",
      "5 weeks",
      "2 weeks",
      "6 months",
      "90 years",
      "84 years",
      "60 years",
      "45 years",
      "30 years",
      "13 years",
      "10 years",
      "5 years",
      "50 years",
      "49 years",
      "588 months",
      "240 months",
      "156 months",
      "11 years",
      "135 months",
      "60 months",
      "30 months",
      "66 months",
      "132 months",
      "82 years",
      "360 months",
      "50 year",
      "140 years",
      "15 years",
      "180 months",
      "168 months",
      "100 years",
      "32 months",
      "58 months",
      "288 days",
      "288 months",
      "288 weeks",
      "12 months",
      "42 months",
      "7 year",
      "7 day",
      "121 days",
      "9 days",
      "9 weeks",
      "9 months",
      "736 weeks",
      "1481 weeks",
      "370 weeks",
      "185 weeks",
      "92 weeks",
      "681 months",
      "23 days",
      "28 years",
      "14 years",
      "5 months",
      "2 months",
      "281 months",
      "281 weeks",
      "281 days",
      "38 days",
      "5 days",
      "56 years",
      "19 days",
      "14 year",
      "1 month",
      "21 months",
      "18 days",
      "15 year",
      "386 weeks",
      "6 years",
      "1080 months",
      "540 months",
      "270 months",
      "30 year",
      "2 year",
      "299 weeks",
      "22 years",
      "364 weeks",
      "216 weeks",
      "3094 days",
      "442 weeks",
      "5628 days",
      "804 weeks",
      "67 days",
      "3095 days",
      "4489 days",
      "641 weeks",
      "40 months",
      "40 days",
      "40 weeks",
      "243 months",
      "127 months",
      "300 days",
      "360 weeks"
    ]
  }
}